Tekla Open API Reference for Tekla Structures 2025
PolygonNode.IsAutomatic Property
 Gets a value indicating whether this geometry node was automatically generated (returns false if it was originally a user-defined part)
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public bool IsAutomatic { get; }
Public ReadOnly Property IsAutomatic As Boolean
	Get
Property Value
Type: Boolean
Implements
IGeometryNode.IsAutomatic
See Also
Reference
PolygonNode Class
Tekla.Structures.Model Namespace